ПД_sev/src/Documents/СчетПокупателя/СчетПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетПокупателя</name>
  <basedOn>Document.СчетПоставщика</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументов</name>
    <type>
      <types>EnumRef.СтатусыПодготовкиДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставленыКлиенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерFM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыСформированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <basedOn>Document.СчетПокупателя</basedOn>
  <basedOn>Document.СчетПоставщика</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Резолюция</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/Documents/СчетПокупателя/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ТакДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТакДанные = Неопределено Тогда		
		РезультатВыполнения = ПроверитьНаличиеДокументаВоВнешнейБазеСервер(ТакДанные.Ссылка);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	 	ПараметрыОжидания.Интервал = 2;	    
	    ДлительныеОперацииКлиент.ОжидатьЗавершение(
	        РезультатВыполнения,
	        Новый ОписаниеОповещения("ОбработатьПолучениеДанныхОНаличииДокументаВоВнешнейБД", ЭтотОбъект),
	        ПараметрыОжидания);				
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеДокументаВоВнешнейБазеСервер(СсылкаСчет)
			
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметровПроцедуры = Новый Структура;	
	СтруктураПараметровПроцедуры.Вставить("СсылкаСчет", СсылкаСчет);
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		// здесь должен быть вызов нашей процедуры
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверить наличие документа Счет во внешней БД'");		
		
		РезультатВыполнения  = ДлительныеОперации.ВыполнитьВФоне( 
		"УправлениеДокументамиСервер.ПроверитьНаличиеСформированногоДокументаВоВнешнейБД", 
		СтруктураПараметровПроцедуры, 
		ПараметрыВыполнения);	

	КонецЕсли;
		
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолучениеДанныхОНаличииДокументаВоВнешнейБД(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.ПодробноеПредставлениеОшибки);
		Возврат
	КонецЕсли;
	стрПараметры = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);	
	//стрПараметры.Вставить("булДокументыСформированы", УправлениеДокументамиСервер.ПроверитьНаличиеСформированногоДокументаВоВнешнейБД(ТакДанные.Ссылка));
	ОткрытьФорму("Документ.СчетПокупателя.Форма.ФормаСписокГенерированныхДокументов", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура СерверДобавитьВПроектНаСервере(ссылкаСчет, ссылкаПроект)
	ОбъектСчет = ссылкаСчет.ПолучитьОбъект();
	ОбъектСчет.Проект = ссылкаПроект;
	ОбъектСчет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПроект(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("КлиентОбработатьВыборПроектяДляДобавленияКСчету", ЭтотОбъект, Новый Структура("СсылкаСчет", ТекСтрока.Ссылка));
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	стрПараметры = Новый Структура;
	Отбор = Новый Структура("Контрагент", ТекСтрока.Контрагент);
	стрПараметры.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",стрПараметры,ЭтаФорма,,,,Оповещение,Режим);
	
	//ДобавитьВПроектНаСервере(ТекСтрока.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура КлиентОбработатьВыборПроектяДляДобавленияКСчету(Результат, ДополнительнаяИнформация) Экспорт 
	Если Результат = Неопределено ТОгда
		Возврат
	КонецЕсли;	
	СерверДобавитьВПроектНаСервере(ДополнительнаяИнформация.СсылкаСчет, Результат);
	Элементы.Список.Обновить();
КонецПроцедуры // КлиентОбработатьВыборПроектяДляДобавленияКСчету()
